{
    "name": "attic",
    "longDescription": "You're in the Attic of the house. The rain is louder up here, closer to the roof. The hatch that leads to the Upper Hall is to the east. There are only a few things up here, but none of them are yours. There's a wooden chest, a box full of winter clothes, and a vanity table. The ceilings and floor are covered in unfinished wood and bits of loose insulation.",
    "shortDescription": "You're in the Attic of the house. The hatch to the Upper Hall is to the east. There's a wooden chest, a box full of winter clothes, and a vanity table with a mirror.",
    "lockRoom": "True",
    "conditionals": {
        "chestRoom": {
            "triggerSequence": ["key", "polaroid3"],
            "triggerVerbs": [["Use", "Open"], ["Take"]],
            "loop": "False",
            "type": "room",
            "0": "",
            "1": "The chest contains a Polaroid covered in a thin layer of dust.",
            "2": ""
        },
        "chest": {
            "triggerSequence": ["key", "polaroid3"],
            "triggerVerbs": [["Use", "Open"], ["Take"]],
            "loop": "False",
            "type": "feature",
            "0": "The sturdy chest is locked with a padlock. It looks ancient.",
            "1": "The sturdy chest looks ancient. Inside, there's nothing but a Polaroid covered in a thin layer of dust.",
            "2": "The chest is unlocked, but empty."
        }
    },
    "exits": {
        "upperHall": "east"
    },
    "verbInteractions": {
        "Examine": {
            "boxes": "The box contains a bunch of thick coats, boots, scarves, and gloves.",
            "clothes": "Just a bunch of someone else's winter clothes. Thick coats, boots, scarves, and gloves.",
            "table": "It's an engraved table with a mirror on top. The whole thing is painted white.",
            "chest": "conditional",
            "walls": "It's a square hole in the ground. Your ladder leads down to the hall below.",
            "floor": "The floor is wooden and poorly maintained. You'd better be careful where you step.",
            "ceiling": "The wooden rafters are stuffed with insulation.",
            "insulation": "Best not to touch it."
        },
        "Use": {
            "clothes": "They probably won't fit."
        },
        "Flip": {
            "chest": "It's too heavy.",
            "boxes": "You knock the boxes over. Nothing happens.",
            "table": "You push the table onto its side. Nothing happens."
        },
        "Eat": {
            "clothes": "No thank you.",
            "insulation": "That's a bad idea."
        },
        "Hide": {
            "chest": "You briefly wonder if you can fit inside the chest. It's pretty big... Nah. The slightest chance of getting stuck inside freaks you out."
        },
        "Listen": {
            "rain": "The loud rain pattering against the roof with all makes you wish you could hide away from it all."
        },
        "Open": {
            "chest": "conditional"
        }
    }
}
