{
  "name": "bathroom",
  "longDescription": "You're in the Bathroom. It's a small, dank room. The sink is dripping, but you can barely hear it over the storm outside. On the west wall, there is a small window next to the claw foot tub. There's a medicine cabinet above the sink, and a towel hanging next to the door. The floor is covered in tile, the walls in dark floral wallpaper. The door back to the Upper Hall is to the east.",
  "shortDescription": "You're in the Bathroom The sink is quietly dripping. There's a window, tub, medicine cabinet, and towel in the room. The door to the Upper Hall is east.",
  "conditionalDescription": {
    "chest": {
      "status": "False",
      "True": "There's nothing in here except a Polaroid photo.",
      "False": "It's a sturdy chest with a padlock. It won't open."
    }
  },
  "exits": {
    "upperHall": "east"
  },
  "verbInteractions": {
    "Examine": {
      "tub": "You inspect the tub, looking for anything that might be out of place. It desperately needs cleaning, but there is nothing unusual here.",
      "window": "It's very small, only meant for ventilation.",
      "medicine cabinet": "It's a shallow box on the wall, clearly more modern than the rest of the bathroom furnishing. The door has a mirror on it, and you catch a glance at yourself. You look pale...and tired.",
      "bandages": "Some cheap bandages. You hope you won't need them.",
      "pill bottle": "It's your prescription for anxiety medication. Lot of good it's doing for you right now..."
    },
    "Open": {
      "window": "You don't need to do that. There's probaly enough dampness and mold in here already.",
      "medicine cabinet": "With a creak, you swing the cabinet door open. There's a box of bandages and a bottle of medicine inside."
    },
    "Flip": {
      "pill bottle": "You have had this prescription for years, but just now notice that the side effects of this medicine includes “seeing or hearing things that others do not see or hear”... You chuckle to yourself. Maybe you ARE imagining things..."
    }
  }
}