{
    "name": "familyRoom",
    "longDescription": "You're in the Family Room. The walls are a solid dark green, and the floor is covered by an antique rug. There's a large shelving unit holding the TV along the west wall. A couple moving boxes that hold your favorite movies. There's a window on the south wall. The Kitchen is to the north, and the door to the Porch is to the east. Next to the east door is a coat rack and some hooks. As you look toward the door, you swear you can hear... scratching.",
    "shortDescription": "You're in the Family Room. There's a large shelving unit holding the TV along the west wall. A couple moving boxes that hold your movies, and a window on the south wall. The Kitchen is to the north, and the Porch to the east. Next to the east door is a coat rack.",
    "lockRoom": "False",
    "conditionals": {
        "keyRoom": {
            "triggerSequence": ["hooks", "key"],
            "triggerVerbs": [["Examine"], ["Take"]],
            "loop": "False",
            "type": "room",
            "0": "There are some hooks on the wall by the door.",
            "1": "There are some hooks on the wall by the door. One of them holds a key.",
            "2": "There are some hooks on the wall by the door."
        },
        "hooks": {
            "triggerSequence": ["hooks", "key"],
            "triggerVerbs": [["Examine"], ["Take"]],
            "loop": "False",
            "type": "feature",
            "0": "There are four hooks screwed into the wall. One of them is holding a key.",
            "1": "There are four hooks screwed into the wall."
        }
    },
    "exits": {
        "kitchen": "north",
        "porch": "east"
    },
    "verbInteractions": {
        "Examine": {
            "walls": "The paint is a rich green. Your favorite color.",
            "floor": "The floor is a nice dark hardwood, the same as most of the house.",
            "ceiling": "The ceiling is painted white. There's a half-globe lamp attached in the middle.",
            "shelves": "It's a heavy wooden shelving unit, made to hold entertainment equipment. There's not much in it yet.",
            "boxes": "You glance through the moving boxes, but there's nothing useful in here.",
            "tv": "You wish you could believe it was just the TV making noise in the house, but that seems unlikely with the power being out.",
            "rack": "It's just a simple metal pole. Your jacket is hanging from it.",
            "jacket": "The jacket is mostly fake leather. There is nothing in the pockets.",
            "door": "The front door is painted dark brown. There are no windows in it.",
            "window": "The front windows are large and look out onto the street, if it wasn't so dark outside.",
            "hooks": "conditional",
            "switch": "The lights aren't working in here either.",
            "movies": "You flip through the movies in one of the boxes. 'The Shining', 'Silence of the Lambs', 'Psycho'... You're normally a bit of a horror movie buff, but for tonight, you don't want to think about it. You shiver and close the box."
        },
        "Flip": {
            "tv": "You wish you could believe it was just the TV making noise in the house, but that seems unlikely with the power being out.",
            "rack": "It's just a simple metal pole. Your jacket is hanging from it."
        },
        "Listen": {
            "scratching": "It's faint, but it's coming from the other side of the front door to the Porch."
        },
        "Take": {
            "jacket": "You don't need it.",
            "movies": "You don't need those.",
            "tv": "You can't take that with you."
        },
        "Open": {
            "boxes": "You glance through the moving boxes, but there's nothing useful in here."
        }
    }
}
