{
    "name": "garage",
    "longDescription": "You are in the Garage of the house. It's mostly empty, as you left your car outside earlier today. The door leading back to the Lower Hall is to the south. You can hear the rain beating down hard outside.",
    "shortDescription": "You are in the Garage. The door back to the Lower Hall is to the south.",
    "lockRoom": "False",
    "conditionals": {
        "ladder": {
            "triggerSequence": ["ladder"],
            "triggerVerbs": [["Take"]],
            "loop": "False",
            "type": "room",
            "0": "You have a bag of basic tools sitting along the north wall, next to a ladder and garden hose.",
            "1": "You have a bag of basic tools sitting along the north wall, next to a garden hose."
        },
        "door": {
            "triggerSequence": ["garageDoor", "garageDoor"],
            "triggerVerbs": [["Open"], ["Close"]],
            "loop": "True",
            "type": "room",
            "0": "The roll-up garage door is to the east, and it is closed.",
            "1": "The roll-up garage door is to the east, and it is open. Rain is pouring in."
        }
    },
    "exits": {
        "lowerHall": "south"
    },
    "verbInteractions": {
        "Examine": {
            "door": "It's a thin metal door big enough for one car. It rolls up to the ceiling.",
            "tools": "You only have a few things in here. Nothing important.",
            "ladder": "It's a small aluminum ladder. Useful for reaching high places."
        },
        "Take": {
            "tools": "You don't need that.",
            "ladder": "You lift the ladder onto your shoulder."
        },
        "Open": {
            "door": "You cross the garage and yank the roll-up door open. Wind and rain rush inside, drenching the floor. You peer into the darkness, but don't see anything outside, except, maybe... No. It's nothing. No way you're going out in that rain."
        },
        "Close": {
            "door": "You pull the garage door closed and immediately feel a little better without the wind and rain coming in."
        }
    }
}
