{
    "name": "kitchen",
    "longDescription": "You're in the Kitchen. This was the room that made you want to buy the place. It was clearly renovated more recently than the rest of the house. Tall wooden cabinets and drawers line the walls for storage. The sink is located on the west wall below the window. The tree outside is scratching at the glass in the wind. The Lower Hall is to the north, the Dining Room to the east, and the Family Room to the south.",
    "shortDescription": "You're in the Kitchen. Cabinets and drawers line the walls. The sink is below the west window. The Lower Hall is to the north, the Dining Room to the east, and the Family Room to the south.",
    "conditionalDescription": {
        "cabinets": {
            "status": "False",
            "True": "The cabinets contain salt, pepper, and paper plates.",
            "False": "There's not much in here yet. Salt, pepper, paper plates, and... a Polaroid photo that you don't remember seeing before."
        },
        "drawers": {
            "status": "False",
            "True": "You have a quick look through the drawers in the kitchen.",
            "False": "You have a quick look through the drawers in the kitchen. Some plastic silverware and a can opener."
        }
    },
    "exits": {
        "lowerHall": "north",
        "diningRoom": "east",
        "familyRoom": "south"
    },
    "verbInteractions": {
        "Examine": {
            "drawers": "You have a quick look through the drawers in the kitchen. Some plastic silverware and a can opener.",
            "cabinet": "You search through the kitchen cabinets. There's not much here yet. Salt, pepper, paper plates, and... What's this? A Polaroid photo?",
            "sink": "The faucet is off and the sink is empty.",
            "polaroid": "An old polaroid photo. Weird.",
            "canOpener": "A basic can opener for opening cans of food. Nothing fancy, but it works."
        },
        "Take": {
            "canOpener": "You take the can opener from a drawer.",
            "polaroid": "You take the polaroid from the cabinets."
        },
        "Use": {
            "sink": "You turn the water on, but nothing happens. You turn it back off."
        }
    }
}
