{
    "name": "masterBedroom",
    "longDescription": "You're in the Master Bedroom of the house, where you sleep. The room is pitch black, except for the occasional flash of lightning through the window. You're standing next to the light switch and the door to the Upper Hall, to the east. There's a closet on the north wall. Windows on the west and south walls. Your mattress, pillow, and blankets are in the middle of the floor. You can't see much.",
    "shortDescription": "You're in the Master Bedroom. Your bed is on the floor. There's a light switch and closet nearby.",
    "lockRoom": "False",
    "conditionals": {
        "boxesRoom": {
            "triggerSequence": ["boxes", "battery"],
            "triggerVerbs": [["Examine", "Open"], ["Take", "Use"]],
            "loop": "False",
            "type": "room",
            "0": "There are two moving boxes of stuff underneath the west window.",
            "1": "There are two moving boxes containing a clock, battery, sheets, and clothes.",
            "2": "There are two moving boxes containing a clock, sheets, and clothes."
        },
        "boxes": {
            "triggerSequence": ["boxes", "battery"],
            "triggerVerbs": [["Examine", "Open"], ["Take", "Use"]],
            "loop": "False",
            "type": "feature",
            "0": "There are a couple boxes here filled with a clock, battery, extra bed sheets, and most of your clothes.",
            "1": "There are a couple boxes here filled with a clock, battery, extra bed sheets, and most of your clothes.",
            "2": "There are a couple boxes here filled with a clock, extra bed sheets, and most of your clothes."
        },
        "clock": {
            "triggerSequence": ["boxes"],
            "triggerVerbs": [["Examine", "Open"]],
            "loop": "False",
            "type": "feature",
            "0": "",
            "1": "It's a clock radio. You normally use it for your morning alarms."
        },
        "sheets": {
            "triggerSequence": ["boxes"],
            "triggerVerbs": [["Examine", "Open"]],
            "loop": "False",
            "type": "feature",
            "0": "",
            "1": "There are a couple bags of bedding. You're not even sure they all fit your current bed."
        },
        "clothes": {
            "triggerSequence": ["boxes"],
            "triggerVerbs": [["Examine", "Open"]],
            "loop": "False",
            "type": "feature",
            "0": "",
            "1": "Some of your t-shirts and shorts are folded into neat piles."
        }
    },
    "exits": {
        "upperHall": "east"
    },
    "verbInteractions": {
        "Examine": {
            "boxes": "conditional",
            "window": "The storm is getting worse. The antique window glass rattles in the wind. You're not going out there.",
            "closet": "It's a very small closet.",
            "walls": "The walls are painted cream. You're not a fan of the color.",
            "ceiling": "It's painted white.",
            "floor": "The floor is a nice dark hardwood, the same as most of the house.",
            "pillow": "Soft... and useless, when you can't sleep.",
            "blanket": "It's a blue and white quilt that you've owned for many years. Your mom made it for you.",
            "switch": "Just a normal light switch.",
            "door": "Just a normal door.",
            "mattress": "It's just a queen mattress, sitting directly on the floor. It's fairly comfortable, even if it isn't fancy.",
            "sheets": "conditional",
            "clock": "conditional",
            "clothes": "conditional"
        },
        "Hide": {
            "mattress": "You curl up in your bed, pulling the blankets over yourself. You hear another THUMP from downstairs. You are not going to be able to sleep until you find out what it is.",
            "closet": "You probably couldn't fit in there if you tried."
        },
        "Open": {
            "boxes": "conditional",
            "closet": "It's empty.",
            "window": "Are you crazy? Not in this weather."
        },
        "Flip": {
            "switch": "The light won't turn on. Looks like the power is still out.",
            "mattress": "It's probably not a good idea to make a mess right now."
        },
        "Use": {
            "clothes": "You don't need to change your clothes right now.",
            "switch": "The light won't turn on. Looks like the power is still out.",
            "window": "You're on the second story of the house. You're not going out there.",
            "mattress": "You sure wish you could go back to sleep, but that's not happening."
        }
    }
}
