{
    "name": "secondBedroom",
    "longDescription": "You're in the Second Bedroom of the house. Your desk is against the north wall, and a large bookcase is built into the west wall. Everything looks strange and unfamiliar in the dark. There's a light switch next to you, and the east door leads back to the Upper Hall.",
    "shortDescription": "You're in the Second Bedroom of the house. A door to the east leads back to the Upper Hall.",
    "lockRoom": "False",
    "conditionals": {
        "boxesRoom": {
            "triggerSequence": ["boxes", "battery"],
            "triggerVerbs": [["Examine", "Open"], ["Take", "Use"]],
            "loop": "False",
            "type": "room",
            "0": "You left some moving boxes in here earlier today, but the room is mostly empty otherwise.",
            "1": "There are moving boxes, containing office supplies and a battery, but the room is mostly empty otherwise.",
            "2": "There are moving boxes, containing office supplies, but the room is mostly empty otherwise."
        },
        "boxes": {
            "triggerSequence": ["boxes", "battery"],
            "triggerVerbs": [["Examine", "Open"], ["Take", "Use"]],
            "loop": "False",
            "type": "feature",
            "0": "You rummage through your boxes, but most of it is office supplies and computer accessories. There's also a loose battery in the bottom of one of the boxes.",
            "1": "You rummage through your boxes, but most of it is office supplies and computer accessories. There's also a loose battery in the bottom of one of the boxes.",
            "2": "You rummage through your boxes, but most of it is office supplies and computer accessories."
        }
    },
    "exits": {
        "upperHall": "east"
    },
    "verbInteractions": {
        "Examine": {
            "boxes": "conditional",
            "desk": "It's a simple desk, without any drawers or extra shelves. But it does the job.",
            "switch": "Just a normal light switch.",
            "ceiling": "This ceiling is painted white, like the one in your bedroom.",
            "walls": "The walls are painted cream. You'll probably change it someday.",
            "floor": "The floor is a nice dark hardwood, the same as most of the house.",
            "bookcase": "One of the things you liked about this house was the huge built-in bookcase here. You're not sure where exactly the movers put your boxes of books, but you were looking forward to organizing your new library... if you can just get through tonight."
        },
        "Hide": {
            "desk": "You cram yourself into the space under the desk. You almost can feel the house shaking in the wind of the storm... but maybe you're just imagining it. You quickly feel uncomfortable and crawl back out."
        },
        "Use": {
            "switch": "No luck. The lights won't turn on."
        },
        "Flip": {
            "switch": "No luck. The lights won't turn on."
        },
        "Open": {
            "boxes": "conditional",
            "desk": "It's a simple desk, without any drawers or extra shelves. But it does the job."
        }
    }
}
