{
  "name": "Upper Hall",
  "longDescription": "You're in the Upper Hall of the house. Without any windows, it is one of the darkest rooms in the house. It feels drafty, and a chill runs over you. You wish you could just go back to bed. You know that you will find the Utility Room to the south, the Bathroom to the west, the Master Bedroom to the southwest, and the Second Bedroom to the northwest. There is an Attic hatch in the ceiling. You are also aware of the old staircase just ahead to the east, which is too dangerous to navigate in the dark. You need to find some light.",
  "shortDescription": "You're in the Upper Hall. The Utility Room is to the south, the Bathroom west, the Master Bedroom southwest, and the Second Bedroom northwest. There is an Attic hatch in the ceiling. The old staircase is just ahead to the east - too dangerous to navigate in the dark.",
  "conditionalDescription": {
    "stairs": {
      "status": "False",
      "true": "string",
      "false": "The stairs are too dangerous in the dark. The last thing you need right now is a broken leg... or worse."
    },
    "light": {
      "status": "False",
      "true": "Now that you have light, you can better see the walls, which still have photos from before you moved here. The previous owners seemed in a rush to sell the place, for some reason unknown to you, and they chose to leave some of their old furnishings - along with a few personal items, it seems. There are three framed pictures on the wall - various photos of a stranger's family. They look… mostly happy.",
      "false": ""
    }
  },
  "exits": {
    "Utility Room": "south",
    "Bathroom": "west",
    "Master Bedroom": "southwest",
    "Second Bedroom": "northwest",
    "Attic": "up",
    "Staircase": "east"
  },
  "verbInteractions": {
    "Look at": {
      "painting": "There are three paintings. The first shows an old, thin woman sitting in the backyard with a child - perhaps her grandchild. The second shows a large group of people standing in front of the house with smiles on their faces, except for a young man near the back with a stern look. The third picture frame has an image of a woman in her 30's or 40's. She is smiling, but the smile isn’t quite reaching her eyes. Despite the fading of the photo, it feels like her gaze is looking straight through you. All three pictures are probably from at least a couple generations ago. One of the paintings is hanging slightly askew."
    },
    "Flip": {
      "painting": "You pull at the frames on the wall, and a small Polaroid photo falls to the floor."
    },
    "Pull": {
      "painting": "You pull at the frames on the wall, and a small Polaroid photo falls to the floor."
    }
  },
  "items": ["polaroid"]
}