{
    "name": "utilityRoom",
    "longDescription": "You're in the Utility Room. The laundry machines are in here. You remember leaving some things in here earlier today, but it was mostly laundry supplies. The exit to the Upper Hall is to the north.",
    "shortDescription": "You're in the Utility Room. The exit to the Upper Hall is to the north.",
    "lockRoom": "False",
    "conditionals": {
        "shelves": {
            "triggerSequence": ["shelves", "flashlight"],
            "triggerVerbs": [["Examine"], ["Take"]],
            "loop": "False",
            "type": "room",
            "0": "There is a shelf on the wall, but you can't see what it's holding.",
            "1": "There is a shelf on the wall, holding a flashlight and a couple containers of laundry detergent.",
            "2": "There is a shelf on the wall, holding a couple containers of laundry detergent."
        },
        "noise": {
            "triggerSequence": ["noise"],
            "triggerVerbs": [["Listen"]],
            "loop": "False",
            "type": "room",
            "0": "Something is making a tapping noise.",
            "1": "You can hear the rain tapping through the laundry vents."
        },
        "flashlight": {
            "triggerSequence": ["shelves", "flashlight"],
            "triggerVerbs": [["Examine"], ["Take"]],
            "loop": "False",
            "type": "feature",
            "0": "",
            "1": "There's a flashlight on the shelf.",
            "2": ""
        }
    },
    "exits": {
        "upperHall": "north"
    },
    "verbInteractions": {
        "Examine": {
            "vent": "Nothing here.",
            "walls": "The walls are flat white.",
            "ceiling": "It's a low ceiling, with a light fixture that isn't working right now.",
            "floor": "The floor is covered in a brown linoleum tile.",
            "machines": "There's a washing machine and a dryer in here. They're both empty.",
            "shelves": "Feeling along the wooden shelves, you can make out the shape of a flashlight, along with a couple containers of laundry detergent.",
            "detergent": "It's just some laundry detergent.",
            "flashlight": "conditional"
        },
        "Listen": {
            "noise": "You listen closely for where the noise is coming from. It seems you can hear the rain's rhythmic tapping through the laundry vents. Not loud enough to be the source of the noise you heard earlier."
        },
        "Open": {
            "machines": "There's nothing in there."
        },
        "Take": {
            "detergent": "You probably don't need that.",
            "flashlight": "You grab the flashlight and push the switch. It isn't working."
        }
    }
}
